Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing Constructor
Overload List
Name | Description
CastUnitDrawing(Identifier)
 Instantiates a new cast unit drawing with standard attributes for a given cast unit.
CastUnitDrawing(Identifier, Int32)
 Instantiates a new cast unit drawing with standard attributes and with a specified sheet number for a given cast unit.
CastUnitDrawing(Identifier, String)
 Instantiates a new cast unit drawing with given attributes for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType)
 Instantiates a new cast unit drawing with standard attributes for a given cast unit.
CastUnitDrawing(Identifier, Int32, String)
 Instantiates a new cast unit drawing with given attributes and with a specified sheet number for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType, Int32)
 Instantiates a new cast unit drawing by id with standard attributes and with a specified sheet number for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType, String)
 Instantiates a new cast unit drawing with given attributes for a given cast unit.
CastUnitDrawing(Identifier, CastUnitDrawing.CastUnitDrawingCreationType, Int32, String)
 Instantiates a new cast unit drawing by id with given attributes and with a specified sheet number for a given cast unit.
Top
See Also
Reference
CastUnitDrawing Class
Tekla.Structures.Drawing Namespace